# Дан массив, состоящий из целых чисел.
# Напишите программу, которая в данном массиве выведет
# количество элементов, у которых два соседних и, при этом,
# оба соседних элемента меньше данного.
# Сначала вводится число N — количество элементов в массиве
# Далее записаны N чисел — элементы массива.
# Массив состоит из целых чисел.
#
# Ввод: 			Ввод:
# 5				5
# 1 2 3 4 5			1 5 1 5 1
#
# Вывод:			Вывод:
# 0				    2


N = int(input('Введите N: '))
print(N)
li1 = [int(input('Введите число: ')) for _ in range(N)]
print(*li1)
n = 0
for i in range(len(li1)-1):
    if li1[i-1] < li1[i] > li1[i+1]:
        n += 1

print(n)

# пример решения от преподавателя
# a = [5, 9, 10, 1, 8, 3, 3, 7, 5, 2]
# count = 0
# for i in range(1,len(a)-1):
#     if a[i-1]<a[i]>a[i+1]:
#         count+=1
# print(count)