#13.Шахматный король ходит по горизонтали, вертикали и диагонали, но только на 1 клетку.
#Даны две различные клетки шахматной доски, определите, может ли король попасть с первой клетки
#на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер
#столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести YES,
#если из первой клетки ходом короля можно попасть во вторую или NO в противном случае.
#В случае, если хотя бы одно из введенных
#чисел не лежит в диапазоне от 1 до 8, выведите строку "Ошибка!".

king_v = int(input())
king_g = int(input())

next_turn_v = int(input())
next_turn_g = int(input())

def checkInput(king)