# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     3
#     -> 1
print(" Введите количество элементов массива")
n = int(input())
lst = [int(input()) for i in range(n)]
print(" Введите отслеживаемый элемент X")
x = int(input())
print(lst.count(x))
