# Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел Ai
# . Последняя строка
# содержит число X

print(" Введите количество элементов массива")
n = int(input())
lst = [int(input()) for i in range(n)]
print(" Введите отслеживаемый элемент X")
x = int(input())
min_range = abs(x - lst[0])
el = lst[0]
for i in lst:
    if abs(x-i) < min_range:
        min_range = abs(x-i)
        el = i
print("самый близкий по величине элемент к заданному числу X = ", el)