# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.

a = [1, 2, 4, 12, 4, 6, 7]
b = [2, 3, 2, 1, 5, 12]
print(*set(a).intersection(set(b)))
