# Дан массив, состоящий из целых чисел. Напишите программу, которая подсчитает
# количество элементов массива, больших предыдущего (элемента с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2
# Пояснение: (-1 < 5, 2 < 3)

current = [1, 2, 12, -4, 66, 12]

#arr = [1, 0, -2, 2, 10, 3, -4, 5, 3, 4, 5]

count = 0
for i in range(1, len(current)):
    if current[i] > current[i-1]:
        count += 1
        print(f"{current[i]} > {current[i-1]}")

print(count)