# Дан список чисел. Посчитайте, сколько в нем пар
# элементов, равных друг другу. Считается,
# что любые два элемента, равные друг другу образуют одну пару,
# которую необходимо посчитать. Вводится список чисел.
# Все числа списка находятся на разных строках.
# Ввод:			Вывод:
# 1 2 3 2 3			2

N = int(input('Введите N: '))
print(N)
li1 = [int(input('Введите число: ')) for _ in range(N)]
print(*li1)
n = 0
d = {}
for i in li1:
    if i in d:
        n += d[i]
    d[i] = d.get(i, 0) + 1

print(n)

# 1. Запрашивает у пользователя ввод значения N и сохраняет его в переменную `N`.
# 2. Выводит значение переменной `N` на экран.
# 3. Создает список `li1`, в котором запрашивает у пользователя ввод `N` чисел и
# каждое введенное число преобразует в целое число с помощью функции `int()`.
# Записывает введенные числа в список `li1`.
# 4. Выводит все элементы списка `li1` на экран,
# используя оператор `*`.
# 5. Инициализирует переменную `n` со значением 0.
# 6. Создает пустой словарь `d`.
# 7. Для каждого элемента `i` в списке `li1` выполняет
# следующие действия:
#    - Проверяет, есть ли элемент `i` в словаре `d`.
#    - Если элемент `i` уже есть в словаре `d`, то увеличивает
#    значение переменной `n` на значение, которое соответствует
#    элементу `i` в словаре `d`.
#    - Затем в словаре `d` увеличивает значение
#    элемента `i` на 1 с помощью метода `.get()` и
#    записывает это значение в словарь `d`.
# 8. Выводит значение переменной `n` на экран.

# import random
# n = int(input("введи размер списка1: "))
# list1 = []
# for i in range(n):
#     lis1 = random.randint(1, 10)
#     list1.append(lis1)
# print(list1)
# count = 0
# for i in range(len(list1)):
#     for j in range(i+1, len(list1)):
#         if list1[i] == list1[j]:
#             count += 1
# print(count)

# пример решения от преподавателя
# lst = [1, 2, 3, 2, 3, 2, 1, 1]
# count = 0
# for i in range(len(lst)):
#     for j in range(i+1,len(lst)):
#         if lst[i]==lst[j]:
#             count += 1
# print(count)