# Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

def sum(a, b):
    if a == 0:  # Базовый случай: если a равно 0, возвращаем b
        return b
    elif b == 0:  # Базовый случай: если b равно 0, возвращаем a
        return a
    return sum(a - 1, b + 1)  # Рекурсивный вызов функции с уменьшением a на 1 и увеличением b на 1
a = int(input("Введите А: "))
b = int(input("Введите B: "))
print(sum(a, b))

